{
     "menu" : {
          "intro": "Summary",
          "formation": "Education",
          "exp": "Experience",
          "skill": "Skills",
          "contact": "Contact",
          "cv": "Resume"
     },
     "introduction" : {
          "nom" : "Hicham Brahimi",
          "resprin" : "Main Residence : Le Havre, France",
          "resonc" : "Current Residence : Le Havre, France",
          "age" : "Age: 26",
          "permis" : "Driving licence + Vehicle",
          "contact": "Contact",
          "p" : "A professional computer scientist for more than 3 years now, my strength is to be very",
          "p1s" : "versatile",
          "p2" : "Whether it's IT or embedded systems, ",
          "p3" : "Whether it's software development or website development, ",
          "p4" : "Whether it's front-end or back-end,",
          "p5" : "I have no problem adapting to meet expectations.",
          "p6" : "My first years in high school were in the electrical engineering field, but I quickly drifted towards my first passion : Computer science. My formation started with a general computer science learning, before specializing in ",
          "p7s" : "Artificial Intelligence",
          "p8s" : "Versatile at heart, don't just rely on my current skills, I enjoy doing my job almost as much as I enjoy learning how to do it.",
          "p9" : "My interests are various. On the one hand, I have a great passion for everything related to popular culture. On the other hand, I also like sports, especially baseball, which I have been playing for more than 3 years now.",
          "p10" : "My professional expectations are simple, a job I ",
          "p11s" : "enjoy",
          "p12" : "to do."
     },
     "form": {
          "f" : "Master 2 — MATIS",
          "f1": "Mathematics and Computer Science of Complex and Distributed Systems",
          "univ1": "University of Le Havre",
          "lieu1" : "Normandie, FRANCE",
          "f2": "Master 1 Computer Science",
          "f21" : "Artificial Intelligence",
          "f22" :"Branch – Agent-based Computing",
          "univ2":"University of Paris Descartes",
          "lieu2" : "Île-de-France, FRANCE",
          "iut" : "University Institute of Technology of Le Havre",
          "lycee" : "High School Robert Schuman",
          "f3": "Licence Computer Science (Three-year university degree)",
          "f4" : "DUT Computer Science (Two-year Institute of Technology degree)",
          "f5" : "Baccalauréat STI (High School diploma)",
          "f51": "Industrial Science and Technology"
     },
     "experience" : {
          "e" : "Research Engineer",
          "e1" : "University of Le Havre — LITIS Laboratory",
          "e2" : "Researcher at the university for 2 years and 11 months, I was in charge of different projects submitted to the RIIC team (Interaction Networks and Collective Intelligence) of the LITIS (Computer Science, Information Processing and Systems Laboratory).",
          "e3" : "These projects were very various, from the JAVA library development to the instrumentation of a marine biosensor.",
          "trav" : "Work accomplished",
          "savoir" : "Learn more",
          "fermer" : "Close",
          "ast" : "Astreos Project",
          "ast2" : "Project valued by the national future investment program (PIA3)",
          "ast3" : "Despite the legislative arsenal gradually adopted by the European community,",
          "ast4s" : "the aquatic environments quality",
          "ast5" : "fails to meet the criteria set by the regulations, especially on the French side of the English Channel.",
          "ast6" : "The marine mussels Mytilus spp. are organisms that are",
          "ast7s" : "sessile and filter feeders",
          "ast8" : ", colonizing the coastal and estuarine intertidal zones of the different continents, including highly anthropized regions, where they are particularly",
          "ast9s" : "exposed to contaminants of all kinds",
          "ast10" : "; these organisms are therefore commonly used as a sentinel species in ",
          "ast11s" : "biomonitoring",
          "ast12" : "in ecotoxicology. The use of",
          "ast13s" : "the valve movement response",
          "ast14" : " has so far been limited by the lack of field devices for automated recording of behaviour sequences and the subsequent knowledge deficit. The fast development of electronics and computer science has opened up new perspectives and allows the emergence of biologging as an approach that allows the quantitative measurement of behaviour without the direct intervention of the researcher.",
          "ast15" : "The ASTREOS program is designed to test the applicability of a biomonitoring strategy for the the Seine bay based on",
          "ast16s" : "measurements of valve activity",
          "ast17" : "  of the Mytilus edulis species. This is a very big project with several successful fundraisers of which I had the privilege of being the first to work on the valvometry part, and I will probably not be the last.",
          "ast18" : "My part of the objective on this project was achieved, namely the realization of a",
          "ast19s" : "functional prototype",
          "ast20" : "able to collect data for several weeks. I worked on the 3 main components of this project : Instrumentation of mussels using Hall effect sensors, the prototype fabrication using nanocomputers and microcontrollers and finally, the creation of the web interface allowing the access and the analysis of the data, as well as the communication with the prototype.",

          "gr" : "Graphstream 2.0",
          "gr2" : "Official project github",
          "gr3" : "GraphStream is a",
          "gr4s" : "Java library for graph management",
          "gr5" : "which focuses on the dynamic aspects of graphs. It mainly focuses on the dynamic interaction networks modeling of various sizes. The migration to 2.0 version has allowed gs-core, the library core module, to emancipate from different technologies to become",
          "gr6s" : "a generic library.",
          "gr7" : "These changes have notably enabled GraphStream to equip itself with a brand new multi-technology visualization system allowing users to choose its graphic interface.",
          "gr8" : "These interfaces, starting with the name gs-ui, are organized in separate projects that share the common use of the new generic properties of gs-core. The version 2 of GraphStream already gathers 3 UI projects named",
          "gr9s" : "gs-ui-swing, gs-ui-javafx as well as a new interface gs-ui-android",
          "gr10" : ", the names suffix describing the technologies used. On the algorithmic side, ",
          "gr11s" : "the replacement of iterators for streams",
          "gr12" : "increased the execution speed of the algorithms on the most powerful machines, by improving the management of multithreading by parallelizing streams.",

          "fire" : "Projet Firediag",
          "fire2" : "The IoT system for the heroes",
          "fire3" : "In 2016, the 246,800 French firefighters carried out more than 4,542,400 interventions, i.e. almost 12,445 interventions per day. Every year, a dozen of them tragically perish during their missions. Flames, smoke, torrents of water, these men and women fight every day to save others in spite of an extremely hostile environment. It is in order to minimize the risks that firefighters are constantly seeking",
          "fire4s" : "new technological solutions.",
          "fire5" : "As firefighters are key members of society, developers, researchers and manufacturers are eager to understand and create the firefighter of tomorrow. Thus, we have also taken an interest in this issue and more specifically",
          "fire6s" : "in the management and processing of all these new tools",
          "fire7" : "that are appearing to help firefighters in their tasks.",
          "fire8" : "We therefore worked on a dashboard in order to",
          "fire9s" : "observe, record and analyze",
          "fire10" : "data from different types of sensors. The objective was to be able to group and visualize using the",
          "fire11s" : "MQTT communication protocol",
          "fire12" : "the live sensor values. This project also served as foundation for the Astreos project interface.",


          "ans" : "years",
          "mois" : "Months",
          "semaines" : "Weeks",


          "e4" : "Engineer — Master 2 internship",
          "e5" : "University of Le Havre — LITIS Laboratory",
          "e6" : "A student project during my Master 2 led me to design a mechanical hand prosthesis, on which we had made modifications, including the addition of embedded electronics so that the user would be able to control his fingers. This internship is the continuation of this project, with the aim of understanding the signals emitted by the brain during movement.",
          "e7" : "Development and improvement of a mechanical prosthesis",
          "e8" : "Interpretation of EEG Signals by Neuron Network",

          "e9" : "JAVA Analyst programmer",
          "e10" : "Exel Connect",
          "e11" : "Warehouse management software development.",
          "e12" : "Software architecture design",
          "e13" : "Assistance in the design and implementation of the database",
          "e14" : "Development of the server and client-server connection",
          "e15" : "Development of a part of the client",
          "e16" : "Documentation writing",

          "e17" : "Web developer — DUT internship",
          "e18" : "Le Havre Port Maintenance Company",
          "e19" : "Development of website and a web application for the quotes automatic generation.",
          "e20" : "Development of a PHP/HTML website",
          "e21" : "Development of an PHP automatic quotation generation application."
     },
     "comp" : {
          "outils" : "Tools",
          "maitrise" : "Mastering",
          "logiciel" : "Software",
          "mobile" : "Mobile",
          "iot" : "IoT",
          "ia" : "AI",
          "web" : "Web",
          "sgbd" : "Database",

          "syst" : "System",
          "language" : "Language",
          "domaine" : "Areas",

          "analyse" : "Analysis",
          "super" : "Supervised",
          "nosuper" : "Unsupervised",
          "renfo" : "Reinforcement",

          "developpe" : "IT",
          "global" : "Global",

          "gestion" : "Project Management",
          "info" : "Computer Science",
          "electro" : "Electronics",
          "meca" : "Mechanics",

          "qualite" : "Qualities",
          "autonome" : "Autonomy",
          "creatif" : "Creativity",
          "passion" : "Passion",
          "adaptabilite" : "Adaptability",
          "polyvalence" : "Versatility"
     },
     "cont" : {
          "nom" : "Name",
          "mail" : "Mail",
          "sujet" : "Subject",
          "vmessage" : "Your Message",
          "envoyer" : "Send"
     }
}
