{
     "menu" : {
          "intro": "Summary",
          "formation": "Education",
          "exp": "Experience",
          "skill": "Skills",
          "contact": "Contact"
     },
     "introduction" : {
          "nom" : "Hicham BRAHIMI",
          "resprin" : "Résidence principale : Le Havre, France",
          "resonc" : "Résidence actuelle : Le Havre, France",
          "age" : "26 ans",
          "permis" : "Permis B + Véhicule",
          "contact": "Contact",
          "p" : "Développeur professionnel depuis maintenant plus de 3 ans, ma particularité est d'être très",
          "p1s" : "polyvalent",
          "p2" : "Que ce soit de l'informatique ou de l'embarquée, ",
          "p3" : "Que ce soit du développement logiciel ou de site web, ",
          "p4" : "Que ce soit du front-end ou du back-end,",
          "p5" : "Je n'ai aucun problème à m'adapter pour répondre aux attentes.",
          "p6" : "Mes premières années passées au lycée furent dans le domaine de l'électrotechnique, mais j'ai rapidement dérivé vers ma passion première : l'Informatique. Ma formation a débuté par un apprentissage général de l'informatique, avant de se spécialiser dans l'",
          "p7s" : "Intelligence Artificielle",
          "p8s" : "Touche à tout dans l'âme, ne vous fiez pas simplement à mes compétences actuelles, j'aime presque autant faire mon travail qu'apprendre à le faire.",
          "p9" : "Mes centres d'intérêt sont diverses. J'ai d'une part une grande passion pour tout ce qui touche à la culture populaire : jeux vidéos, cartes, plateaux ou encore bandes dessinées. D'autre part, j'aime également le sport et notamment le Baseball que je pratique maintenant depuis plus de 3 ans.",
          "p10" : "Mes attentes professionnel sont simples, un travail capable de me rendre",
          "p11s" : "heureux",
          "p12" : "par le simple fait d'aller au boulot."
     },
     "form": {
          "f" : "Master 2 — MATIS",
          "f1": "Mathématiques et Informatique des Systèmes Complexes et Distribués",
          "univ1": "Université du Havre",
          "lieu1" : "Normandie, FRANCE",
          "f2": "Master 1 Informatique",
          "f21" : "Intelligence Artificielle",
          "f22" :"Parcours – Agent-based Computing",
          "univ2":"Université Paris Descartes",
          "lieu2" : "Île-de-France, FRANCE",
          "iut" : "Institut Universitaire de Technologie du Havre",
          "lycee" : "Lycée Robert Schuman",
          "f3": "Licence Informatique",
          "f4" : "DUT informatique",
          "f5" : "Baccalauréat STI",
          "f51": "Science et Technique Industrielle"
     },
     "experience" : {
          "e" : "Ingénieur d'études",
          "e1" : "Université du Havre — Laboratoire LITIS",
          "e2" : "Chercheur à l'université durant 2 ans et 11 mois, je fus en charge de différents projets soumis à l'équipe RIIC (Réseaux d’interactions et Intelligence Collective) du LITIS (Laboratoire d'Informatique, du Traitement de l'Information et des Systèmes).",
          "e3" : "Ces projets furent de nature très variés, allant de la librairie JAVA à l'instrumentalisation de biocapteur marin.",
          "trav" : "Travaux effectués",
          "savoir" : "En savoir plus",
          "fermer" : "Fermer",
          "ast" : "Projet Astreos",
          "ast2" : "Projet valorisé par le programme des investissements d’avenir (PIA3)",
          "ast3" : "Malgré l'arsenal législatif adopté progressivement par la communauté européenne,",
          "ast4s" : "la qualité des milieux aquatiques",
          "ast5" : "ne parvient pas à atteindre les critères fixés par la réglementation, en particulier sur la façade française de la Manche.",
          "ast6" : "Les moules marines Mytilus spp. sont des organismes",
          "ast7s" : "sessiles et filtreurs",
          "ast8" : ", colonisant les zones intertidales littorales et estuariennes des différents continents, incluant les régions fortement anthropisées, où elles sont particulièrement",
          "ast9s" : "exposées aux contaminants de toutes natures",
          "ast10" : "; ces organismes sont de ce fait communément utilisés comme espèce sentinelle dans les programmes de ",
          "ast11s" : "biosurveillance",
          "ast12" : "en écotoxicologie. L'utilisation de la",
          "ast13s" : "mesure des mouvements valvaires",
          "ast14" : ", communément appelée valvométrie en biosurveillance active a été jusqu'à maintenant limitée par l'absence de dispositifs de terrain permettant l’enregistrement automatisé de séquences de comportement et par le déficit subséquent en connaissances. Le développement rapide de l’électronique et de l’informatique a ouvert de nouvelles perspectives et permet l'émergence du biologging comme approche permettant la mesure quantitative du comportement sans intervention directe de l'expérimentateur.",
          "ast15" : "Le programme ASTREOS est destiné à tester l’applicabilité d’une stratégie de biosurveillance de la Baie de Seine s’appuyant sur les",
          "ast16s" : "mesures in situ de l’activité valvaire",
          "ast17" : "de moules de l’espèce Mytilus edulis. Il s'agit d'un très gros projet ayant réussi plusieurs levées de fonds dont j'ai eu le privilège d'être le premier à travailler sur la partie valvométrie, et je ne serai sans doute pas le dernier.",
          "ast18" : "Ma part de l'objectif sur ce projet a été atteinte, à savoir la réalisation d'un",
          "ast19s" : "prototype terrain",
          "ast20" : "capable de récolter des données durant plusieurs semaines. J'ai travaillé notamment sur les 3 composantes principales de ce projet : L'instrumentalisation de moules à l'aide de capteurs à effet Hall, la fabrication du prototype terrain à l'aide de nano-ordinateurs et de microcontrôleurs et enfin, la réalisation de l'interface web permettant l'accès et l'analyse des données, ainsi que la communication avec le prototype.",

          "gr" : "Graphstream 2.0",
          "gr2" : "Github officiel du projet",
          "gr3" : "GraphStream est une",
          "gr4s" : "librairie Java de gestion de graphes",
          "gr5" : "qui se concentre sur les aspects dynamiques des graphes. Elle se concentre principalement sur la modélisation de réseaux d'interaction dynamiques de tailles diverses. La transition vers la version 2.0 a permis à gs-core, le module central de la librairie, de s’émanciper de différentes technologies pour devenir",
          "gr6s" : "une librairie générique.",
          "gr7" : "Ces changements ont notamment permis à GraphStream de s’équiper d’un tout nouveau système de visualisation multi-technologique offrant à l’utilisateur le choix de son interface graphique.",
          "gr8" : "Ces interfaces, commençant par la dénomination gs-ui, sont organisées en projets distincts qui ont en commun l’utilisation des nouvelles propriétés génériques de gs-core. La version 2 de GraphStream regroupe déjà à ce jour 3 projets d’UI répondant au nom de",
          "gr9s" : "gs-ui-swing, gs-ui-javafx ainsi qu'une toute nouvelle interface gs-ui-android",
          "gr10" : ", le suffixe des noms décrivant les technologies utilisées. Côté algorithmique, ",
          "gr11s" : "l'abandon des itérateurs pour les streams",
          "gr12" : "ont permis d'augmenter la vitesse d’exécution des algorithmes sur les machines les plus puissantes, en améliorant la gestion du multithreading par la parallélisation des streams.",

          "fire" : "Projet Firediag",
          "fire2" : "L'écosystème IoT au service des héros",
          "fire3" : "En 2016, les 246.800 sapeurs-pompiers français ont effectué plus de 4.542.400 interventions, c'est-à-dire près de 12.445 interventions par jour. Chaque année, une dizaine d’entre eux périssent tragiquement au cours de leurs missions. Flammes, fumée, torrents d’eau, ces hommes et femmes se battent chaque jour afin de sauver d’autres personnes en dépit d’un environnement extrêmement hostile. C’est dans le but de réduire les risques au minimum que les sapeurs-pompiers recherchent en permanence de",
          "fire4s" : "nouvelles solutions technologiques.",
          "fire5" : "Les pompiers étant des acteurs primordiaux de la société, développeurs, chercheurs et fabricants s’empresse de comprendre et de créer le pompier de demain. Ainsi, nous nous sommes également intéressés à ce problème et plus particulièrement à la",
          "fire6s" : "gestion et au traitement de tous ces nouveaux outils",
          "fire7" : "qui apparaissent afin d’aider les pompiers dans leur tâche.",
          "fire8" : "Nous avons donc travaillé sur un tableau de bord dans le but",
          "fire9s" : "d’observer, enregistrer et analyser",
          "fire10" : "les données issues de différents types de capteurs. L'objectif était de parvenir à regrouper et visualiser à l'aide du protocole de",
          "fire11s" : "communication MQTT",
          "fire12" : "les valeurs des capteurs en direct. Ce projet a servi également de base à l'interface du projet Astreos.",


          "ans" : "ans",
          "mois" : "Mois",
          "semaines" : "Semaines",


          "e4" : "Ingénieur — Stage de Master 2",
          "e5" : "Université du Havre — Laboratoire LITIS",
          "e6" : "Un projet étudiant au cours de mon Master 2 m'a amené à concevoir une prothèse de main mécanique, sur laquelle nous avions effectué des modifications, notamment l’ajout d’électronique embarquée afin que l’utilisateur soit capable de contrôler ses doigts. Ce stage est la continuité de ce projet, avec pour objectif de comprendre les signaux émis par le cerveau au cours d’un mouvement.",
          "e7" : "Développement et amélioration d'une prothèse mécanique",
          "e8" : "Interprétation de Signaux EEG par Réseau de Neurones",

          "e9" : "Analyste programmeur JAVA",
          "e10" : "Exel Connect",
          "e11" : "Développement d'un logiciel de gestion d'entrepôts.",
          "e12" : "Conception de l'architecture logicielle",
          "e13" : "Aide à la conception et à la mise en place de la base de données",
          "e14" : "Développement du serveur et de la liaison client-serveur",
          "e15" : "Développement d'une partie du client",
          "e16" : "Rédaction de documentation",

          "e17" : "Développeur Web — Stage de DUT",
          "e18" : "Société de Maintenance Portuaire Havraise",
          "e19" : "Développement d'une application web de génération automatique de devis et d'un site web.",
          "e20" : "Développement d'un site web PHP/HTML",
          "e21" : "Développement d'une application de génération automatique de Devis en PHP"
     },
     "comp" : {
          "outils" : "Tools",
          "maitrise" : "Mastering",
          "logiciel" : "Software",
          "mobile" : "Mobile",
          "iot" : "IoT",
          "ia" : "AI",
          "web" : "Web",
          "sgbd" : "Database",

          "syst" : "System",
          "language" : "Language",
          "domaine" : "Areas",

          "analyse" : "Analysis",
          "super" : "Supervised",
          "nosuper" : "Unsupervised",
          "renfo" : "Reinforcement",

          "developpe" : "IT",
          "global" : "Global",

          "gestion" : "Project Management",
          "info" : "Computer Science",
          "electro" : "Electronics",
          "meca" : "Mechanics"
     },
     "cont" : {
          "nom" : "Name",
          "mail" : "Mail",
          "sujet" : "Subject",
          "vmessage" : "Your Message",
          "envoyer" : "Send"
     }
}
